package com.example.quest.repository;

import com.example.quest.entity.Question;

import java.util.List;

public class PrisonQuest extends BaseQuest {

    @Override
    public void initQuest() {
        questName = "Prison Escape";

        questions.add(new Question(
                "Ви прокидаєтесь у в'язничній камері. Що робити?",
                List.of("Залишитись на місці", "Оглянути камеру"),
                1,
                "Ви вирішили залишитися на місці. Гвардії повернулися, і ви втратили шанс на втечу. Поразка!",
                ""));
        questions.add(new Question(
                "Ви знайшли прихований тунель. Продовжити?",
                List.of("Вперед у тунель", "Повернутись назад"),
                0,
                "Ви повернулися назад. Гвардії знайшли вас і посадили в ізолятор. Поразка!",
                ""));
        questions.add(new Question(
                "Тунель веде до розгалуження. Який шлях вибрати?",
                List.of("Ліворуч", "Праворуч"),
                1,
                "Лівий тунель був пасткою. Ви застрягли і були спіймані. Поразка!",
                ""));
        questions.add(new Question(
                "Ви вийшли до виходу, але охоронець стоїть на шляху. Що робити?",
                List.of("Атакувати охоронця", "Сховатися і почекати"),
                1,
                "Ви атакували охоронця, але він виявився сильнішим. Поразка!",
                ""));
        questions.add(new Question(
                "Охоронець пішов, і шлях вільний. Втекти?",
                List.of("Втекти", "Залишитися"),
                0,
                "Ви вирішили залишитися. Гвардійці знайшли вас і повернули до камери. Поразка!",
                "Ви втекли з в'язниці і здобули свободу. Перемога!"));
    }
}
